MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU806/mcu.h
/* RPOR7 */
#define _RP96R RPOR7bits.RP96R
#define _RP97R RPOR7bits.RP97R
#define _RP96R0 RPOR7bits.RP96R0
#define _RP96R1 RPOR7bits.RP96R1
#define _RP96R2 RPOR7bits.RP96R2
#define _RP96R3 RPOR7bits.RP96R3
#define _RP96R4 RPOR7bits.RP96R4
#define _RP96R5 RPOR7bits.RP96R5
#define _RP97R0 RPOR7bits.RP97R0
#define _RP97R1 RPOR7bits.RP97R1
#define _RP97R2 RPOR7bits.RP97R2
#define _RP97R3 RPOR7bits.RP97R3
#define _RP97R4 RPOR7bits.RP97R4
#define _RP97R5 RPOR7bits.RP97R5

/* RPOR8 */
#define _RP99R RPOR8bits.RP99R
#define _RP99R0 RPOR8bits.RP99R0
#define _RP99R1 RPOR8bits.RP99R1
#define _RP99R2 RPOR8bits.RP99R2
#define _RP99R3 RPOR8bits.RP99R3
#define _RP99R4 RPOR8bits.RP99R4
#define _RP99R5 RPOR8bits.RP99R5

/* RPOR9 */
#define _RP100R RPOR9bits.RP100R
#define _RP101R RPOR9bits.RP101R
#define _RP100R0 RPOR9bits.RP100R0
#define _RP100R1 RPOR9bits.RP100R1
#define _RP100R2 RPOR9bits.RP100R2
#define _RP100R3 RPOR9bits.RP100R3
#define _RP100R4 RPOR9bits.RP100R4
#define _RP100R5 RPOR9bits.RP100R5
#define _RP101R0 RPOR9bits.RP101R0
#define _RP101R1 RPOR9bits.RP101R1
#define _RP101R2 RPOR9bits.RP101R2
#define _RP101R3 RPOR9bits.RP101R3
#define _RP101R4 RPOR9bits.RP101R4
#define _RP101R5 RPOR9bits.RP101R5

/* RPOR13 */
#define _RP118R RPOR13bits.RP118R
#define _RP118R0 RPOR13bits.RP118R0
#define _RP118R1 RPOR13bits.RP118R1
#define _RP118R2 RPOR13bits.RP118R2
#define _RP118R3 RPOR13bits.RP118R3
#define _RP118R4 RPOR13bits.RP118R4
#define _RP118R5 RPOR13bits.RP118R5

/* RPOR14 */
#define _RP120R RPOR14bits.RP120R
#define _RP120R0 RPOR14bits.RP120R0
#define _RP120R1 RPOR14bits.RP120R1
#define _RP120R2 RPOR14bits.RP120R2
#define _RP120R3 RPOR14bits.RP120R3
#define _RP120R4 RPOR14bits.RP120R4
#define _RP120R5 RPOR14bits.RP120R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT3R RPINR1bits.INT3R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT3R0 RPINR1bits.INT3R0
#define _INT3R1 RPINR1bits.INT3R1
#define _INT3R2 RPINR1bits.INT3R2
#define _INT3R3 RPINR1bits.INT3R3
#define _INT3R4 RPINR1bits.INT3R4
#define _INT3R5 RPINR1bits.INT3R5
#define _INT3R6 RPINR1bits.INT3R6

/* RPINR2 */
#define _INT4R RPINR2bits.INT4R
#define _RSVR RPINR2bits.RSVR
#define _INT4R0 RPINR2bits.INT4R0
#define _INT4R1 RPINR2bits.INT4R1
#define _INT4R2 RPINR2bits.INT4R2
#define _INT4R3 RPINR2bits.INT4R3
#define _INT4R4 RPINR2bits.INT4R4
#define _INT4R5 RPINR2bits.INT4R5
#define _INT4R6 RPINR2bits.INT4R6
#define _RSVR0 RPINR2bits.RSVR0
#define _RSVR1 RPINR2bits.RSVR1
#define _RSVR2 RPINR2bits.RSVR2
#define _RSVR3 RPINR2bits.RSVR3
#define _RSVR4 RPINR2bits.RSVR4
#define _RSVR5 RPINR2bits.RSVR5
#define _RSVR6 RPINR2bits.RSVR6

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T3CKR RPINR3bits.T3CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6
#define _T3CKR0 RPINR3bits.T3CKR0
#define _T3CKR1 RPINR3bits.T3CKR1
#define _T3CKR2 RPINR3bits.T3CKR2
#define _T3CKR3 RPINR3bits.T3CKR3
#define _T3CKR4 RPINR3bits.T3CKR4
#define _T3CKR5 RPINR3bits.T3CKR5
#define _T3CKR6 RPINR3bits.T3CKR6

/* RPINR4 */
#define _T4CKR RPINR4bits.T4CKR
#define _T5CKR RPINR4bits.T5CKR
#define _T4CKR0 RPINR4bits.T4CKR0
#define _T4CKR1 RPINR4bits.T4CKR1
#define _T4CKR2 RPINR4bits.T4CKR2
#define _T4CKR3 RPINR4bits.T4CKR3
#define _T4CKR4 RPINR4bits.T4CKR4
#define _T4CKR5 RPINR4bits.T4CKR5
#define _T4CKR6 RPINR4bits.T4CKR6
#define _T5CKR0 RPINR4bits.T5CKR0
#define _T5CKR1 RPINR4bits.T5CKR1
#define _T5CKR2 RPINR4bits.T5CKR2
#define _T5CKR3 RPINR4bits.T5CKR3
#define _T5CKR4 RPINR4bits.T5CKR4
#define _T5CKR5 RPINR4bits.T5CKR5
#define _T5CKR6 RPINR4bits.T5CKR6

/* RPINR5 */
#define _T6CKR RPINR5bits.T6CKR
#define _T7CKR RPINR5bits.T7CKR
#define _T6CKR0 RPINR5bits.T6CKR0
#define _T6CKR1 RPINR5bits.T6CKR1
#define _T6CKR2 RPINR5bits.T6CKR2
#define _T6CKR3 RPINR5bits.T6CKR3
#define _T6CKR4 RPINR5bits.T6CKR4
#define _T6CKR5 RPINR5bits.T6CKR5
#define _T6CKR6 RPINR5bits.T6CKR6
#define _T7CKR0 RPINR5bits.T7CKR0
#define _T7CKR1 RPINR5bits.T7CKR1
#define _T7CKR2 RPINR5bits.T7CKR2
#define _T7CKR3 RPINR5bits.T7CKR3
#define _T7CKR4 RPINR5bits.T7CKR4
#define _T7CKR5 RPINR5bits.T7CKR5
#define _T7CKR6 RPINR5bits.T7CKR6

/* RPINR6 */
#define _T8CKR RPINR6bits.T8CKR
#define _T9CKR RPINR6bits.T9CKR
#define _T8CKR0 RPINR6bits.T8CKR0
#define _T8CKR1 RPINR6bits.T8CKR1
#define _T8CKR2 RPINR6bits.T8CKR2
#define _T8CKR3 RPINR6bits.T8CKR3
#define _T8CKR4 RPINR6bits.T8CKR4
#define _T8CKR5 RPINR6bits.T8CKR5
#define _T8CKR6 RPINR6bits.T8CKR6
#define _T9CKR0 RPINR6bits.T9CKR0
#define _T9CKR1 RPINR6bits.T9CKR1
#define _T9CKR2 RPINR6bits.T9CKR2
#define _T9CKR3 RPINR6bits.T9CKR3
#define _T9CKR4 RPINR6bits.T9CKR4
#define _T9CKR5 RPINR6bits.T9CKR5
#define _T9CKR6 RPINR6bits.T9CKR6

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC1R6 RPINR7bits.IC1R6
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5
#define _IC2R6 RPINR7bits.IC2R6

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC3R6 RPINR8bits.IC3R6
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5
#define _IC4R6 RPINR8bits.IC4R6

