MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU806/mcu.h
/* RPINR24 */
#define _CSDIR RPINR24bits.CSDIR
#define _CSCKR RPINR24bits.CSCKR
#define _CSDIR0 RPINR24bits.CSDIR0
#define _CSDIR1 RPINR24bits.CSDIR1
#define _CSDIR2 RPINR24bits.CSDIR2
#define _CSDIR3 RPINR24bits.CSDIR3
#define _CSDIR4 RPINR24bits.CSDIR4
#define _CSDIR5 RPINR24bits.CSDIR5
#define _CSDIR6 RPINR24bits.CSDIR6
#define _CSCKR0 RPINR24bits.CSCKR0
#define _CSCKR1 RPINR24bits.CSCKR1
#define _CSCKR2 RPINR24bits.CSCKR2
#define _CSCKR3 RPINR24bits.CSCKR3
#define _CSCKR4 RPINR24bits.CSCKR4
#define _CSCKR5 RPINR24bits.CSCKR5
#define _CSCKR6 RPINR24bits.CSCKR6

/* RPINR25 */
#define _COFSR RPINR25bits.COFSR
#define _COFSR0 RPINR25bits.COFSR0
#define _COFSR1 RPINR25bits.COFSR1
#define _COFSR2 RPINR25bits.COFSR2
#define _COFSR3 RPINR25bits.COFSR3
#define _COFSR4 RPINR25bits.COFSR4
#define _COFSR5 RPINR25bits.COFSR5
#define _COFSR6 RPINR25bits.COFSR6

/* RPINR26 */
#define _C1RXR RPINR26bits.C1RXR
#define _C2RXR RPINR26bits.C2RXR
#define _C1RXR0 RPINR26bits.C1RXR0
#define _C1RXR1 RPINR26bits.C1RXR1
#define _C1RXR2 RPINR26bits.C1RXR2
#define _C1RXR3 RPINR26bits.C1RXR3
#define _C1RXR4 RPINR26bits.C1RXR4
#define _C1RXR5 RPINR26bits.C1RXR5
#define _C1RXR6 RPINR26bits.C1RXR6
#define _C2RXR0 RPINR26bits.C2RXR0
#define _C2RXR1 RPINR26bits.C2RXR1
#define _C2RXR2 RPINR26bits.C2RXR2
#define _C2RXR3 RPINR26bits.C2RXR3
#define _C2RXR4 RPINR26bits.C2RXR4
#define _C2RXR5 RPINR26bits.C2RXR5
#define _C2RXR6 RPINR26bits.C2RXR6

/* RPINR27 */
#define _U3RXR RPINR27bits.U3RXR
#define _U3CTSR RPINR27bits.U3CTSR
#define _U3RXR0 RPINR27bits.U3RXR0
#define _U3RXR1 RPINR27bits.U3RXR1
#define _U3RXR2 RPINR27bits.U3RXR2
#define _U3RXR3 RPINR27bits.U3RXR3
#define _U3RXR4 RPINR27bits.U3RXR4
#define _U3RXR5 RPINR27bits.U3RXR5
#define _U3RXR6 RPINR27bits.U3RXR6
#define _U3CTSR0 RPINR27bits.U3CTSR0
#define _U3CTSR1 RPINR27bits.U3CTSR1
#define _U3CTSR2 RPINR27bits.U3CTSR2
#define _U3CTSR3 RPINR27bits.U3CTSR3
#define _U3CTSR4 RPINR27bits.U3CTSR4
#define _U3CTSR5 RPINR27bits.U3CTSR5
#define _U3CTSR6 RPINR27bits.U3CTSR6

/* RPINR28 */
#define _U4RXR RPINR28bits.U4RXR
#define _U4CTSR RPINR28bits.U4CTSR
#define _U4RXR0 RPINR28bits.U4RXR0
#define _U4RXR1 RPINR28bits.U4RXR1
#define _U4RXR2 RPINR28bits.U4RXR2
#define _U4RXR3 RPINR28bits.U4RXR3
#define _U4RXR4 RPINR28bits.U4RXR4
#define _U4RXR5 RPINR28bits.U4RXR5
#define _U4RXR6 RPINR28bits.U4RXR6
#define _U4CTSR0 RPINR28bits.U4CTSR0
#define _U4CTSR1 RPINR28bits.U4CTSR1
#define _U4CTSR2 RPINR28bits.U4CTSR2
#define _U4CTSR3 RPINR28bits.U4CTSR3
#define _U4CTSR4 RPINR28bits.U4CTSR4
#define _U4CTSR5 RPINR28bits.U4CTSR5
#define _U4CTSR6 RPINR28bits.U4CTSR6

/* RPINR29 */
#define _SDI3R RPINR29bits.SDI3R
#define _SCK3R RPINR29bits.SCK3R
#define _SDI3R0 RPINR29bits.SDI3R0
#define _SDI3R1 RPINR29bits.SDI3R1
#define _SDI3R2 RPINR29bits.SDI3R2
#define _SDI3R3 RPINR29bits.SDI3R3
#define _SDI3R4 RPINR29bits.SDI3R4
#define _SDI3R5 RPINR29bits.SDI3R5
#define _SDI3R6 RPINR29bits.SDI3R6
#define _SCK3R0 RPINR29bits.SCK3R0
#define _SCK3R1 RPINR29bits.SCK3R1
#define _SCK3R2 RPINR29bits.SCK3R2
#define _SCK3R3 RPINR29bits.SCK3R3
#define _SCK3R4 RPINR29bits.SCK3R4
#define _SCK3R5 RPINR29bits.SCK3R5
#define _SCK3R6 RPINR29bits.SCK3R6

/* RPINR30 */
#define _SS3R RPINR30bits.SS3R
#define _SS3R0 RPINR30bits.SS3R0
#define _SS3R1 RPINR30bits.SS3R1
#define _SS3R2 RPINR30bits.SS3R2
#define _SS3R3 RPINR30bits.SS3R3
#define _SS3R4 RPINR30bits.SS3R4
#define _SS3R5 RPINR30bits.SS3R5
#define _SS3R6 RPINR30bits.SS3R6

/* RPINR31 */
#define _SDI4R RPINR31bits.SDI4R
#define _SCK4R RPINR31bits.SCK4R
#define _SDI4R0 RPINR31bits.SDI4R0
#define _SDI4R1 RPINR31bits.SDI4R1
#define _SDI4R2 RPINR31bits.SDI4R2
#define _SDI4R3 RPINR31bits.SDI4R3
#define _SDI4R4 RPINR31bits.SDI4R4
#define _SDI4R5 RPINR31bits.SDI4R5
#define _SDI4R6 RPINR31bits.SDI4R6
#define _SCK4R0 RPINR31bits.SCK4R0
#define _SCK4R1 RPINR31bits.SCK4R1
#define _SCK4R2 RPINR31bits.SCK4R2
#define _SCK4R3 RPINR31bits.SCK4R3
#define _SCK4R4 RPINR31bits.SCK4R4
#define _SCK4R5 RPINR31bits.SCK4R5
#define _SCK4R6 RPINR31bits.SCK4R6

/* RPINR32 */
#define _SS4R RPINR32bits.SS4R
#define _SS4R0 RPINR32bits.SS4R0
#define _SS4R1 RPINR32bits.SS4R1
#define _SS4R2 RPINR32bits.SS4R2
#define _SS4R3 RPINR32bits.SS4R3
#define _SS4R4 RPINR32bits.SS4R4
#define _SS4R5 RPINR32bits.SS4R5
#define _SS4R6 RPINR32bits.SS4R6

/* RPINR33 */
#define _IC9R RPINR33bits.IC9R
#define _IC10R RPINR33bits.IC10R
#define _IC9R0 RPINR33bits.IC9R0
#define _IC9R1 RPINR33bits.IC9R1
#define _IC9R2 RPINR33bits.IC9R2
#define _IC9R3 RPINR33bits.IC9R3
#define _IC9R4 RPINR33bits.IC9R4
#define _IC9R5 RPINR33bits.IC9R5
#define _IC9R6 RPINR33bits.IC9R6
#define _IC10R0 RPINR33bits.IC10R0
#define _IC10R1 RPINR33bits.IC10R1
#define _IC10R2 RPINR33bits.IC10R2
#define _IC10R3 RPINR33bits.IC10R3
#define _IC10R4 RPINR33bits.IC10R4
#define _IC10R5 RPINR33bits.IC10R5
#define _IC10R6 RPINR33bits.IC10R6

/* RPINR34 */
#define _IC11R RPINR34bits.IC11R
#define _IC12R RPINR34bits.IC12R
#define _IC11R0 RPINR34bits.IC11R0
#define _IC11R1 RPINR34bits.IC11R1
#define _IC11R2 RPINR34bits.IC11R2
#define _IC11R3 RPINR34bits.IC11R3
#define _IC11R4 RPINR34bits.IC11R4
#define _IC11R5 RPINR34bits.IC11R5
#define _IC11R6 RPINR34bits.IC11R6
#define _IC12R0 RPINR34bits.IC12R0
#define _IC12R1 RPINR34bits.IC12R1
#define _IC12R2 RPINR34bits.IC12R2
#define _IC12R3 RPINR34bits.IC12R3
#define _IC12R4 RPINR34bits.IC12R4
#define _IC12R5 RPINR34bits.IC12R5
#define _IC12R6 RPINR34bits.IC12R6

/* RPINR35 */
#define _IC13R RPINR35bits.IC13R
#define _IC14R RPINR35bits.IC14R
#define _IC13R0 RPINR35bits.IC13R0
#define _IC13R1 RPINR35bits.IC13R1
#define _IC13R2 RPINR35bits.IC13R2
#define _IC13R3 RPINR35bits.IC13R3
#define _IC13R4 RPINR35bits.IC13R4
#define _IC13R5 RPINR35bits.IC13R5
#define _IC13R6 RPINR35bits.IC13R6
#define _IC14R0 RPINR35bits.IC14R0
#define _IC14R1 RPINR35bits.IC14R1
#define _IC14R2 RPINR35bits.IC14R2
#define _IC14R3 RPINR35bits.IC14R3
#define _IC14R4 RPINR35bits.IC14R4
#define _IC14R5 RPINR35bits.IC14R5
#define _IC14R6 RPINR35bits.IC14R6

/* RPINR36 */
#define _IC15R RPINR36bits.IC15R
#define _IC16R RPINR36bits.IC16R
#define _IC15R0 RPINR36bits.IC15R0
#define _IC15R1 RPINR36bits.IC15R1
#define _IC15R2 RPINR36bits.IC15R2
#define _IC15R3 RPINR36bits.IC15R3
#define _IC15R4 RPINR36bits.IC15R4
#define _IC15R5 RPINR36bits.IC15R5
#define _IC15R6 RPINR36bits.IC15R6
#define _IC16R0 RPINR36bits.IC16R0
#define _IC16R1 RPINR36bits.IC16R1
#define _IC16R2 RPINR36bits.IC16R2
#define _IC16R3 RPINR36bits.IC16R3
#define _IC16R4 RPINR36bits.IC16R4
#define _IC16R5 RPINR36bits.IC16R5
#define _IC16R6 RPINR36bits.IC16R6

/* RPINR37 */
#define _OCFCR RPINR37bits.OCFCR
#define _SYNCI1R RPINR37bits.SYNCI1R
#define _OCFCR0 RPINR37bits.OCFCR0
#define _OCFCR1 RPINR37bits.OCFCR1
#define _OCFCR2 RPINR37bits.OCFCR2
#define _OCFCR3 RPINR37bits.OCFCR3
#define _OCFCR4 RPINR37bits.OCFCR4
#define _OCFCR5 RPINR37bits.OCFCR5
#define _OCFCR6 RPINR37bits.OCFCR6
#define _SYNCI1R0 RPINR37bits.SYNCI1R0
#define _SYNCI1R1 RPINR37bits.SYNCI1R1
#define _SYNCI1R2 RPINR37bits.SYNCI1R2
#define _SYNCI1R3 RPINR37bits.SYNCI1R3
#define _SYNCI1R4 RPINR37bits.SYNCI1R4
#define _SYNCI1R5 RPINR37bits.SYNCI1R5
#define _SYNCI1R6 RPINR37bits.SYNCI1R6

