MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU806/mcu.h
#define _RPINR4_T5CKR5_POSITION                  0x0000000D
#define _RPINR4_T5CKR5_MASK                      0x00002000
#define _RPINR4_T5CKR5_LENGTH                    0x00000001

#define _RPINR4_T5CKR6_POSITION                  0x0000000E
#define _RPINR4_T5CKR6_MASK                      0x00004000
#define _RPINR4_T5CKR6_LENGTH                    0x00000001

#define _RPINR5_T6CKR_POSITION                   0x00000000
#define _RPINR5_T6CKR_MASK                       0x0000007F
#define _RPINR5_T6CKR_LENGTH                     0x00000007

#define _RPINR5_T7CKR_POSITION                   0x00000008
#define _RPINR5_T7CKR_MASK                       0x00007F00
#define _RPINR5_T7CKR_LENGTH                     0x00000007

#define _RPINR5_T6CKR0_POSITION                  0x00000000
#define _RPINR5_T6CKR0_MASK                      0x00000001
#define _RPINR5_T6CKR0_LENGTH                    0x00000001

#define _RPINR5_T6CKR1_POSITION                  0x00000001
#define _RPINR5_T6CKR1_MASK                      0x00000002
#define _RPINR5_T6CKR1_LENGTH                    0x00000001

#define _RPINR5_T6CKR2_POSITION                  0x00000002
#define _RPINR5_T6CKR2_MASK                      0x00000004
#define _RPINR5_T6CKR2_LENGTH                    0x00000001

#define _RPINR5_T6CKR3_POSITION                  0x00000003
#define _RPINR5_T6CKR3_MASK                      0x00000008
#define _RPINR5_T6CKR3_LENGTH                    0x00000001

#define _RPINR5_T6CKR4_POSITION                  0x00000004
#define _RPINR5_T6CKR4_MASK                      0x00000010
#define _RPINR5_T6CKR4_LENGTH                    0x00000001

#define _RPINR5_T6CKR5_POSITION                  0x00000005
#define _RPINR5_T6CKR5_MASK                      0x00000020
#define _RPINR5_T6CKR5_LENGTH                    0x00000001

#define _RPINR5_T6CKR6_POSITION                  0x00000006
#define _RPINR5_T6CKR6_MASK                      0x00000040
#define _RPINR5_T6CKR6_LENGTH                    0x00000001

#define _RPINR5_T7CKR0_POSITION                  0x00000008
#define _RPINR5_T7CKR0_MASK                      0x00000100
#define _RPINR5_T7CKR0_LENGTH                    0x00000001

#define _RPINR5_T7CKR1_POSITION                  0x00000009
#define _RPINR5_T7CKR1_MASK                      0x00000200
#define _RPINR5_T7CKR1_LENGTH                    0x00000001

#define _RPINR5_T7CKR2_POSITION                  0x0000000A
#define _RPINR5_T7CKR2_MASK                      0x00000400
#define _RPINR5_T7CKR2_LENGTH                    0x00000001

#define _RPINR5_T7CKR3_POSITION                  0x0000000B
#define _RPINR5_T7CKR3_MASK                      0x00000800
#define _RPINR5_T7CKR3_LENGTH                    0x00000001

#define _RPINR5_T7CKR4_POSITION                  0x0000000C
#define _RPINR5_T7CKR4_MASK                      0x00001000
#define _RPINR5_T7CKR4_LENGTH                    0x00000001

#define _RPINR5_T7CKR5_POSITION                  0x0000000D
#define _RPINR5_T7CKR5_MASK                      0x00002000
#define _RPINR5_T7CKR5_LENGTH                    0x00000001

#define _RPINR5_T7CKR6_POSITION                  0x0000000E
#define _RPINR5_T7CKR6_MASK                      0x00004000
#define _RPINR5_T7CKR6_LENGTH                    0x00000001

#define _RPINR6_T8CKR_POSITION                   0x00000000
#define _RPINR6_T8CKR_MASK                       0x0000007F
#define _RPINR6_T8CKR_LENGTH                     0x00000007

#define _RPINR6_T9CKR_POSITION                   0x00000008
#define _RPINR6_T9CKR_MASK                       0x00007F00
#define _RPINR6_T9CKR_LENGTH                     0x00000007

#define _RPINR6_T8CKR0_POSITION                  0x00000000
#define _RPINR6_T8CKR0_MASK                      0x00000001
#define _RPINR6_T8CKR0_LENGTH                    0x00000001

#define _RPINR6_T8CKR1_POSITION                  0x00000001
#define _RPINR6_T8CKR1_MASK                      0x00000002
#define _RPINR6_T8CKR1_LENGTH                    0x00000001

#define _RPINR6_T8CKR2_POSITION                  0x00000002
#define _RPINR6_T8CKR2_MASK                      0x00000004
#define _RPINR6_T8CKR2_LENGTH                    0x00000001

#define _RPINR6_T8CKR3_POSITION                  0x00000003
#define _RPINR6_T8CKR3_MASK                      0x00000008
#define _RPINR6_T8CKR3_LENGTH                    0x00000001

#define _RPINR6_T8CKR4_POSITION                  0x00000004
#define _RPINR6_T8CKR4_MASK                      0x00000010
#define _RPINR6_T8CKR4_LENGTH                    0x00000001

#define _RPINR6_T8CKR5_POSITION                  0x00000005
#define _RPINR6_T8CKR5_MASK                      0x00000020
#define _RPINR6_T8CKR5_LENGTH                    0x00000001

#define _RPINR6_T8CKR6_POSITION                  0x00000006
#define _RPINR6_T8CKR6_MASK                      0x00000040
#define _RPINR6_T8CKR6_LENGTH                    0x00000001

#define _RPINR6_T9CKR0_POSITION                  0x00000008
#define _RPINR6_T9CKR0_MASK                      0x00000100
#define _RPINR6_T9CKR0_LENGTH                    0x00000001

#define _RPINR6_T9CKR1_POSITION                  0x00000009
#define _RPINR6_T9CKR1_MASK                      0x00000200
#define _RPINR6_T9CKR1_LENGTH                    0x00000001

#define _RPINR6_T9CKR2_POSITION                  0x0000000A
#define _RPINR6_T9CKR2_MASK                      0x00000400
#define _RPINR6_T9CKR2_LENGTH                    0x00000001

#define _RPINR6_T9CKR3_POSITION                  0x0000000B
#define _RPINR6_T9CKR3_MASK                      0x00000800
#define _RPINR6_T9CKR3_LENGTH                    0x00000001

#define _RPINR6_T9CKR4_POSITION                  0x0000000C
#define _RPINR6_T9CKR4_MASK                      0x00001000
#define _RPINR6_T9CKR4_LENGTH                    0x00000001

#define _RPINR6_T9CKR5_POSITION                  0x0000000D
#define _RPINR6_T9CKR5_MASK                      0x00002000
#define _RPINR6_T9CKR5_LENGTH                    0x00000001

#define _RPINR6_T9CKR6_POSITION                  0x0000000E
#define _RPINR6_T9CKR6_MASK                      0x00004000
#define _RPINR6_T9CKR6_LENGTH                    0x00000001

#define _RPINR7_IC1R_POSITION                    0x00000000
#define _RPINR7_IC1R_MASK                        0x0000007F
#define _RPINR7_IC1R_LENGTH                      0x00000007

#define _RPINR7_IC2R_POSITION                    0x00000008
#define _RPINR7_IC2R_MASK                        0x00007F00
#define _RPINR7_IC2R_LENGTH                      0x00000007

#define _RPINR7_IC1R0_POSITION                   0x00000000
#define _RPINR7_IC1R0_MASK                       0x00000001
#define _RPINR7_IC1R0_LENGTH                     0x00000001

#define _RPINR7_IC1R1_POSITION                   0x00000001
#define _RPINR7_IC1R1_MASK                       0x00000002
#define _RPINR7_IC1R1_LENGTH                     0x00000001

