MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MU806/mcu.h
#define ALTI2C1_ON           0x002F
#define ALTI2C1_OFF          0x003F

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   Reset Target Vector Select bit:
**     RSTPRI_AF            Device will obtain reset instruction from Aux flash
**     RSTPRI_PF            Device will obtain reset instruction from Primary flash
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0x00F4
#define ICS_PGD3             0x00F5
#define ICS_PGD2             0x00F6
#define ICS_PGD1             0x00F7

#define RSTPRI_AF            0x00F3
#define RSTPRI_PF            0x00F7

#define JTAGEN_OFF           0x00D7
#define JTAGEN_ON            0x00F7

/* Register FAS (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FAS;
#define _FAS(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FAS.sec"),space(prog))) __prog__ uint16_t _FAS = (x);

/*
** Only one invocation of FAS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FAS.
** Multiple options may be combined, as shown:
**
** _FAS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Auxiliary Segment Write-protect bit:
**     AWRP_ON              Aux Flash is write protected
**     AWRP_OFF             Aux Flash may be written
**
**   Auxiliary Segment Code-protect bit:
**     APL_ON               Aux Flash Code protect is enabled
**     APL_OFF              Aux Flash Code protect is disabled
**
**   Auxiliary Segment Key bits:
**     APLK_OFF             Aux Flash Write Protection and Code Protection is Disabled
**     APLK_ON              Aux Flash Write Protection or Code Protection is Enabled
**
*/

#define AWRP_ON              0x0032
#define AWRP_OFF             0x0033

#define APL_ON               0x0031
#define APL_OFF              0x0033

#define APLK_OFF             0x0003
#define APLK_ON              0x0033

/* Register FUID0 (0xf80012)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FUID0;
#define _FUID0(x) __attribute__((address(0xf80012),deprecated_definition("consider migrating to #pragma config"),section("__FUID0.sec"),space(prog))) __prog__ uint16_t _FUID0 = (x);

/*
** Only one invocation of FUID0 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FUID0.
** Multiple options may be combined, as shown:
**
** _FUID0( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   :
**
*/




/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x2aa00

#define __AUXFLASH_BASE 0x7fc000
#define __AUXFLASH_LENGTH 0x3ffa

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FAS_BASE 0xf80010
#define __FAS_LENGTH 0x2

#define __FUID0_BASE 0xf80012
#define __FUID0_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000

#define __YDATA_BASE 0x5000
#define __YDATA_LENGTH 0x5000
#define __DMA_BASE 0x7000
#define __DMA_LENGTH 0x1000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1 6
#define _RPOUT_SS1 7
#define _RPOUT_SS2 10
#define _RPOUT_CSDO 11
#define _RPOUT_CSCK 12
#define _RPOUT_COFS 13
#define _RPOUT_C1TX 14
#define _RPOUT_C2TX 15
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_OC5 20
#define _RPOUT_OC6 21
#define _RPOUT_OC7 22
#define _RPOUT_OC8 23
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_U3TX 27
#define _RPOUT_U3RTS 28
#define _RPOUT_U4TX 29
#define _RPOUT_U4RTS 30
#define _RPOUT_SDO3 31
#define _RPOUT_SCK3 32
#define _RPOUT_SS3 33
#define _RPOUT_SDO4 34
#define _RPOUT_SCK4 35
#define _RPOUT_SS4 36
#define _RPOUT_OC9 37
#define _RPOUT_OC10 38
#define _RPOUT_OC11 39
#define _RPOUT_OC12 40
#define _RPOUT_OC13 41
#define _RPOUT_OC14 42
#define _RPOUT_OC15 43
#define _RPOUT_OC16 44
#define _RPOUT_SYNCO1 45
#define _RPOUT_SYNCO2 46
#define _RPOUT_QEI1CCMP 47
#define _RPOUT_QEI2CCMP 48
#define _RPOUT_REFCLK 49

#endif
